Revit 2027 API
BuiltInFailures.CurtainWallFailures.GridOutOfOrderError Property
 Curtain wall grid lines have changed order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridOutOfOrderError { get; }
Public Shared ReadOnly Property GridOutOfOrderError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridOutOfOrderError {
	FailureDefinitionId^ get ();
}
static member GridOutOfOrderError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace